ci4/app/Controllers/Artikel.php

    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();
        // $artikel = $model->findAll();
        $data = [
            'title'   => $title,
            'q'       => $q,
            'artikel' => $model->like('judul', $q)->paginate(3), #data dibatasi 4 record per halaman
---
SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 3, 3
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'

    public function add()
    {
        // validasi data.
        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();
        if ($isDataValid) {

            $file = $this->request->getFile('gambar');
            $file->move(ROOTPATH . 'public/gambar');

            $artikel = new ArtikelModel();
            $artikel->insert([
                'judul' => $this->request->getPost('judul'),
                'isi'   => $this->request->getPost('isi'),
                'slug'  => url_title($this->request->getVar('judul')),
                'gambar'=> $file -> getName(),
            ]);
---
INSERT INTO `artikel` (`judul`, `isi`, `slug`, `gambar`) VALUES ('Artikel Ketujuh', 'Tulus (penyanyi Indonesia) Muhammad Tulus, S.Ars atau lebih dikenali sebagai Tulus (lahir di Bukittinggi, Sumatera Barat, 20 Ogos 1987; umur 35 tahun) merupakan seorang penyanyi, pemuzik, pelakon, dan penulis lagu Indonesia yang berdarah Minangkabau.\r\nBandar Asal: Bandung\r\nNama lahir: Muhammad Tulus\r\nNama lain: Tulus', 'Artikel-Ketujuh', 'tulus.jpeg')